app/Controllers/Login.php

    public function auth()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'admin@admin'
 LIMIT 1