app/Controllers/Productos.php

    public function index()
    {
        // Verificar login
        if (!session()->get('logueado')) {
            return redirect()->to('/login')->with('error', 'sesión no iniciada');
        }

        $productosModel = new ProductosModel();
        $data['productos'] = $productosModel->findAll();
---
SELECT *
FROM `productos`

    public function detalle($id = null)
    {
        // Chequear login
        if (!session()->get('logueado')) {
            return redirect()->to('/login')->with('error', 'Sesión no iniciada');
        }

        $productosModel = new ProductosModel();
        $producto = $productosModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '4'